MYiR-Dev/myir-imx-linux/drivers/staging/rtl8733bu/core/rtw_ap.c
					SET_HT_OP_ELE_STA_CHL_WIDTH(pht_info, 1);

					SET_HT_OP_ELE_2ND_CHL_OFFSET(pht_info,
						(pmlmeext->cur_ch_offset == HAL_PRIME_CHNL_OFFSET_LOWER) ?
						HT_INFO_HT_PARAM_SECONDARY_CHNL_ABOVE : HT_INFO_HT_PARAM_SECONDARY_CHNL_BELOW);

					pmlmepriv->sw_to_20mhz = 0;
					/*
					sta_info_update_type |= STA_INFO_UPDATE_BW;
					beacon_updated = _TRUE;
					*/

					RTW_INFO("%s:switching back to 40Mhz\n", __FUNCTION__);
				}
			}
		}

		/* to update  ht_op_mode*/
		*(u16 *)(pht_info->infos + 1) = cpu_to_le16(pmlmepriv->ht_op_mode);

	}

	/*associated_clients_update(padapter, beacon_updated, sta_info_update_type);*/
#endif /* CONFIG_80211N_HT */
}

static void update_bcn_rsn_ie(_adapter *padapter)
{
	RTW_INFO("%s\n", __FUNCTION__);

}

static void update_bcn_wpa_ie(_adapter *padapter)
{
	RTW_INFO("%s\n", __FUNCTION__);

}

static void update_bcn_wmm_ie(_adapter *padapter)
{
	RTW_INFO("%s\n", __FUNCTION__);

}

static void update_bcn_wps_ie(_adapter *padapter)
{
	u8 *pwps_ie = NULL, *pwps_ie_src, *premainder_ie, *pbackup_remainder_ie = NULL;
	uint wps_ielen = 0, wps_offset, remainder_ielen;
	struct mlme_priv *pmlmepriv = &(padapter->mlmepriv);
	struct mlme_ext_priv	*pmlmeext = &(padapter->mlmeextpriv);
	struct mlme_ext_info	*pmlmeinfo = &(pmlmeext->mlmext_info);
	WLAN_BSSID_EX *pnetwork = &(pmlmeinfo->network);
	unsigned char *ie = pnetwork->IEs;
	u32 ielen = pnetwork->IELength;


	RTW_INFO("%s\n", __FUNCTION__);

	pwps_ie = rtw_get_wps_ie(ie + _FIXED_IE_LENGTH_, ielen - _FIXED_IE_LENGTH_, NULL, &wps_ielen);

	if (pwps_ie == NULL || wps_ielen == 0)
		return;

	pwps_ie_src = pmlmepriv->wps_beacon_ie;
	if (pwps_ie_src == NULL)
		return;

	wps_offset = (uint)(pwps_ie - ie);

	premainder_ie = pwps_ie + wps_ielen;

	remainder_ielen = ielen - wps_offset - wps_ielen;

	if (remainder_ielen > 0) {
		pbackup_remainder_ie = rtw_malloc(remainder_ielen);
		if (pbackup_remainder_ie)
			_rtw_memcpy(pbackup_remainder_ie, premainder_ie, remainder_ielen);
	}

	wps_ielen = (uint)pwps_ie_src[1];/* to get ie data len */
	if ((wps_offset + wps_ielen + 2 + remainder_ielen) <= MAX_IE_SZ) {
		_rtw_memcpy(pwps_ie, pwps_ie_src, wps_ielen + 2);
		pwps_ie += (wps_ielen + 2);

		if (pbackup_remainder_ie)
			_rtw_memcpy(pwps_ie, pbackup_remainder_ie, remainder_ielen);

		/* update IELength */
		pnetwork->IELength = wps_offset + (wps_ielen + 2) + remainder_ielen;
	}

	if (pbackup_remainder_ie)
		rtw_mfree(pbackup_remainder_ie, remainder_ielen);

	/* deal with the case without set_tx_beacon_cmd() in update_beacon() */
#if defined(CONFIG_INTERRUPT_BASED_TXBCN) || defined(CONFIG_PCI_HCI)
	if ((pmlmeinfo->state & 0x03) == WIFI_FW_AP_STATE) {
		u8 sr = 0;
		rtw_get_wps_attr_content(pwps_ie_src,  wps_ielen, WPS_ATTR_SELECTED_REGISTRAR, (u8 *)(&sr), NULL);

		if (sr) {
			set_fwstate(pmlmepriv, WIFI_UNDER_WPS);
			RTW_INFO("%s, set WIFI_UNDER_WPS\n", __func__);
		} else {
			clr_fwstate(pmlmepriv, WIFI_UNDER_WPS);
			RTW_INFO("%s, clr WIFI_UNDER_WPS\n", __func__);
		}
	}
#endif
}

static void update_bcn_p2p_ie(_adapter *padapter)
{

}

#ifdef CONFIG_ECSA
static void ap_process_csa(struct _ADAPTER *a)
{
	struct rf_ctl_t *rfctl = adapter_to_rfctl(a);
	WLAN_BSSID_EX *pnetwork = &(a->mlmeextpriv.mlmext_info.network);
#ifdef CONFIG_CONCURRENT_MODE
	struct mlme_priv *pmlmepriv;
	_adapter *linking_adapter;
#endif
	u8 ifbmp = 0;

	rtw_remove_bcn_ie(a, pnetwork, WLAN_EID_SECONDARY_CHANNEL_OFFSET);
	rtw_remove_bcn_ie(a, pnetwork, WLAN_EID_CHANNEL_SWITCH_WRAPPER);

	if (rfctl->ap_csa_en == AP_SWITCH_CH_CSA) {
		/* Stop beacon until update beacon from hostapd, only CSA from cfg80211 will update */
		bcn_control_cmd(a, 0);

		ifbmp = BIT(a->iface_id);
		rtw_change_bss_chbw_cmd(a, 0, ifbmp, 0, rfctl->ap_csa_ch,
					rfctl->ap_csa_bw, rfctl->ap_csa_ch_offset);
	} else if (rfctl->ap_csa_en == CSA_STA_DISCONN_ON_DFS) {
		ifbmp = BIT(a->iface_id);
		rtw_change_bss_chbw_cmd(a, 0, ifbmp, 0, rfctl->ap_csa_ch,
				rfctl->ap_csa_bw, rfctl->ap_csa_ch_offset);
	}
#ifdef CONFIG_CONCURRENT_MODE
	else if (rfctl->ap_csa_en == CSA_STA_JOINBSS) {
		linking_adapter = rtw_mi_get_linking_adapter(a);
		if (linking_adapter) {
			pmlmepriv = &(linking_adapter->mlmepriv);
			rtw_joinbss_cmd(linking_adapter, &(rfctl->csa_candidate_network));
		} else {
			rfctl->ap_csa_en = AP_CSA_DISABLE;
			RTW_ERR("Can't find the linking STA\n");
		}
	}
#endif
}

static u8 _update_csa_ie(struct _ADAPTER *a)
{
	struct rf_ctl_t *rfctl = adapter_to_rfctl(a);
	u8 chan = rfctl->ap_csa_ch;
	u8 count = rfctl->ap_csa_switch_cnt;
	WLAN_BSSID_EX *pnetwork = &(a->mlmeextpriv.mlmext_info.network);
	u8 *ies = pnetwork->IEs + _BEACON_IE_OFFSET_;
	sint ies_len = pnetwork->IELength - _BEACON_IE_OFFSET_;
	u8 *csa_ie;
	sint csa_ie_len;

	csa_ie = rtw_get_ie(ies, WLAN_EID_CHANNEL_SWITCH, &csa_ie_len, ies_len);

	if (csa_ie && csa_ie_len == CSA_IE_LEN) {
		if (count > 0) {
			/* update CSA IE */
		#ifdef DBG_CSA
			RTW_INFO("CSA : "FUNC_ADPT_FMT" ch=%u, count=%u, update CSA IE\n",
				FUNC_ADPT_ARG(a), chan, count);
		#endif

			csa_ie = csa_ie + 2;
			csa_ie[2] = count;
		} else {
			/* remove CSA IE */
			RTW_INFO("CSA : "FUNC_ADPT_FMT" ch=%u, count=%u, remove CSA IE\n",
				FUNC_ADPT_ARG(a), chan, count);

			rtw_remove_bcn_ie(a, pnetwork, WLAN_EID_CHANNEL_SWITCH);
		}
		return _TRUE;
	} else {
		RTW_ERR("CSA : "FUNC_ADPT_FMT" unexpected case\n",
				FUNC_ADPT_ARG(a));
		return _FALSE;
	}
}

static u8 _update_ecsa_ie(struct _ADAPTER *a)
{
	struct rf_ctl_t *rfctl = adapter_to_rfctl(a);
	u8 chan = rfctl->ap_csa_ch;
	u8 count = rfctl->ap_csa_switch_cnt;
	WLAN_BSSID_EX *pnetwork = &(a->mlmeextpriv.mlmext_info.network);
	u8 *ies = pnetwork->IEs + _BEACON_IE_OFFSET_;
	sint ies_len = pnetwork->IELength - _BEACON_IE_OFFSET_;
	u8 *ecsa_ie;
	sint ecsa_ie_len;

	ecsa_ie = rtw_get_ie(ies, WLAN_EID_ECSA, &ecsa_ie_len, ies_len);

	if (ecsa_ie && ecsa_ie_len == ECSA_IE_LEN) {
		if (count > 0) {
			/* update CSA IE */
		#ifdef DBG_CSA
			RTW_INFO("CSA : "FUNC_ADPT_FMT" ch=%u, count=%u, update ECSA IE\n",
				FUNC_ADPT_ARG(a), chan, count);
		#endif
			ecsa_ie = ecsa_ie + 2;
			ecsa_ie[3] = count;
		} else {
			/* remove ECSA IE */
			RTW_INFO("CSA : "FUNC_ADPT_FMT" ch=%u, count=%u, remove ECSA IE\n",
				FUNC_ADPT_ARG(a), chan, count);

			rtw_remove_bcn_ie(a, pnetwork, WLAN_EID_ECSA);
		}
		return _TRUE;
	} else {
		RTW_ERR("CSA : "FUNC_ADPT_FMT" unexpected case\n",
				FUNC_ADPT_ARG(a));
		return _FALSE;
	}
}

static u8 update_csa_ie(struct _ADAPTER *a)
{
	struct rf_ctl_t *rfctl = adapter_to_rfctl(a);
	bool update = _FALSE;

	if (rfctl->ap_csa_en == AP_CSA_DISABLE || rfctl->ap_csa_remove_ie)
		return _FALSE;

	update = _update_csa_ie(a);

	if (rtw_is_ecsa_enabled(a))
		update |= _update_ecsa_ie(a);

